app/views/bookings/_calendar.html.slim

SELECT `bookings`.* FROM `bookings` WHERE (`bookings`.meetingroom_id = 5) AND (created_at BETWEEN '2011-08-21 22:00:00' AND '2011-08-22 21:59:59')
---
        = meetingroom.title
      - meetingroom.bookings.for_day(@date || Date.today).each do |booking|