app/views/bookings/_form.html.slim

    /.meetingrooms.top-margin
    /  - Meetingroom.all.each do |meetingroom|
---
SELECT `meetingrooms`.* FROM `meetingrooms` ORDER BY title DESC