app/views/users/edit.html.slim

SELECT `users`.* FROM `users` LIMIT 1
---
    .field
      - unless @user.id == User.first.id