app/views/users/index.html.slim

SELECT `users`.* FROM `users`
---
  - if can_edit?
    p= link_to 'Send E-Mail til *alle* brugere', "mailto:#{User.all.map(&:email).join(', ')}", :confirm => t('admin.are_you_sure')