app/views/users/show.html.slim

      .top-margin.edit
        = link_to 'book mødelokale', new_meetingroom_booking_path(Meetingroom.first), :class => 'button'
---
SELECT `meetingrooms`.* FROM `meetingrooms` LIMIT 1