app/views/companies/index.html.slim

SELECT COUNT(*) FROM `company_thumbs` WHERE (`company_thumbs`.company_id = 13)
SELECT `companies`.* FROM `companies`
SELECT `company_thumbs`.* FROM `company_thumbs` WHERE (`company_thumbs`.company_id = 13) ORDER BY company_thumbs.id DESC LIMIT 1
---
              .image
                - if company.company_thumbs.any?