app/views/gallery/index.html.erb

SELECT `photos`.* FROM `photos`
---
				<ul class="thumbs noscript">
					<% Photo.all.each do |photo| %>