app/controllers/bookings_controller.rb

  def create
    session[:go_to_after_edit] = nil
    @meetingroom = Meetingroom.first
---
SELECT `meetingrooms`.* FROM `meetingrooms` ORDER BY title DESC