app/controllers/bookings_controller.rb

SELECT `bookings`.* FROM `bookings` WHERE (created_at > '2011-08-21 00:00:00') AND (created_at < '2011-08-29 23:59:59')
SELECT `info_pages`.* FROM `info_pages`
SELECT `meetingrooms`.* FROM `meetingrooms` LIMIT 1
---
  def index
    @bookings = Booking.scoped
    @bookings = @bookings.after(Time.at(params['start'].to_i)) if (params['start'])
    @bookings = @bookings.before(Time.at(params['end'].to_i)) if (params['end'])
    @bookings = @bookings.order(sort_column + ' ' + sort_direction).paginate(:per_page => 24, :page => params[:page]) unless params['start'] or params['end']
    @meetingroom ||= Meetingroom.first

SELECT `bookings`.* FROM `bookings` WHERE (`bookings`.meetingroom_id = 5) AND (created_at BETWEEN '2011-08-21 22:00:00' AND '2011-08-22 21:59:59')
---
  def new
    @booking = Booking.new
    @booking.created_at = params[:date].present?? params[:date].to_date : Date.today

SELECT `bookings`.* FROM `bookings` WHERE (`bookings`.meetingroom_id = 5) AND (created_at BETWEEN '2011-08-29 22:00:00' AND '2011-08-30 21:59:59') AND (starttime < '2011-08-29 12:53:00' AND endtime > '2011-08-29 11:53:00')
SELECT `meetingrooms`.* FROM `meetingrooms` WHERE `meetingrooms`.`id` = 5 LIMIT 1
INSERT INTO `bookings` (`meetingroom_id`, `starttime`, `endtime`, `attendees`, `bookers_name`, `created_at`, `updated_at`, `user_id`, `message`, `custom_message`, `coffee_and_tea`, `bread`) VALUES (5, '2011-08-22 07:22:00', '2011-08-22 10:22:00', 12, 'Someone', '2011-08-21 22:00:00', '2011-08-22 05:22:57', NULL, NULL, 'Hatte hylde', 1, 0)
---
  def create
    session[:go_to_after_edit] = nil
    @meetingroom = Meetingroom.find(params[:booking][:meetingroom_id])#Meetingroom.first
    @booking.meetingroom = @meetingroom
    create! { new_meetingroom_booking_path(@meetingroom, :date => @booking.created_at)}

SELECT `bookings`.* FROM `bookings` WHERE (`bookings`.meetingroom_id = 5) AND (bookings.id != 34) AND (created_at BETWEEN '2011-08-21 22:00:00' AND '2011-08-22 21:59:59') AND (starttime < '2000-01-01 10:22:00' AND endtime > '2000-01-01 07:22:00')
SELECT `meetingrooms`.* FROM `meetingrooms` WHERE `meetingrooms`.`id` = 5 LIMIT 1
---
  def update
    session[:go_to_after_edit] = nil
    @meetingroom = Meetingroom.find(params[:booking][:meetingroom_id])#Meetingroom.first