app/controllers/company_thumbs_controller.rb

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 2 LIMIT 1
SELECT `company_thumbs`.* FROM `company_thumbs` WHERE `company_thumbs`.`id` = 22 AND (`company_thumbs`.company_id = 2) LIMIT 1
---
  def update

    @company = Company.find(params[:company_id])
    @company_thumb = @company.company_thumbs.find(params[:id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 2 LIMIT 1
INSERT INTO `company_thumbs` (`created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `company_id`) VALUES ('2011-08-23 10:59:23', '2011-08-23 10:59:23', 'max_avatar.jpg', 'image/jpeg', 12768, '2011-08-23 10:59:22', 2)
---
  def create
    @company = Company.find(params[:company_id])
    @company_thumb = @company.company_thumbs.create(params[:company_thumb])