app/controllers/companies_controller.rb

  def index
    session[:go_to_after_edit] = companies_path
    @companies = Company.order('title asc').paginate(:per_page => 12, :page => params[:page])
    if user_signed_in?
      @newsposts = Newspost.internal.order('created_at desc').paginate(:per_page => 3, :page => params[:page])
---
SELECT COUNT(*) FROM `companies`
SELECT `companies`.* FROM `companies` ORDER BY title asc LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM `newsposts`
SELECT `newsposts`.* FROM `newsposts` ORDER BY created_at desc LIMIT 3 OFFSET 0

  def update
    @company = Company.find(params[:id])
    if @company.update_attributes(params[:company])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 2 LIMIT 1
UPDATE `companies` SET `body` = '<p><strong>Vores indgangsvinkel til arbejdet med organisationsudvikling er baseret p&aring; vores filosofi om, at virksomheder og organisationer, n&aring;r alt kommer til alt, er mennesker - og stort set alt, hvad der sker, er baseret p&aring; menneskelig adf&aelig;rd.</strong></p>\r\n<p>intenz er ikke bare et navn, men et udtryk for vores m&aring;ls&aelig;tning om at intensivere menneskelig adf&aelig;rd og organisationers performance, s&aring; de til enhver tid kan leve op til de krav, et omskifteligt samfund stiller.</p>\r\n<p>Centralt er, at virksomhedens kultur er st&aelig;rk og rustet til disse krav - at organisationen t&aelig;nker, f&oslash;ler og g&oslash;r det rigtige.</p>', `updated_at` = '2011-06-12 15:48:55' WHERE `companies`.`id` = 1

  def create

    @company = Company.new(params[:company])
    if @company.save
---
INSERT INTO `companies` (`title`, `body`, `phone`, `homepage`, `created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`) VALUES ('intenz A/S', 'Vores indgangsvinkel til arbejdet med organisationsudvikling er baseret på vores filosofi om, at virksomheder og organisationer, når alt kommer til alt, er mennesker - og stort set alt, hvad der sker, er baseret på menneskelig adfærd.\r\n\r\nintenz er ikke bare et navn, men et udtryk for vores målsætning om at intensivere menneskelig adfærd og organisationers performance, så de til enhver tid kan leve op til de krav, et omskifteligt samfund stiller.\r\n\r\nCentralt er, at virksomhedens kultur er stærk og rustet til disse krav - at organisationen tænker, føler og gør det rigtige.', '+45 7013 3500', 'www.intenz.com', '2011-06-12 15:47:32', '2011-06-12 15:47:32', NULL, NULL, NULL, NULL)

  def show
    @link = '<a href="http://'+@company.homepage+'">'+@company.homepage+'<a/>'
    if user_signed_in?
      @newsposts = Newspost.internal.order('created_at desc').paginate(:per_page => 3, :page => params[:page])
---
SELECT COUNT(*) FROM `newsposts`
SELECT `newsposts`.* FROM `newsposts` ORDER BY created_at desc LIMIT 3 OFFSET 0