app/controllers/gallery_controller.rb

SELECT `photos`.* FROM `photos`
---
  def index
    @gallery = Photo.all