app/controllers/meetingrooms_controller.rb

  def update

    @meetingroom = Meetingroom.find(params[:id])
    if @meetingroom.update_attributes(params[:meetingroom])
      if params[:meetingroom][:image].blank?
---
SELECT `meetingrooms`.* FROM `meetingrooms` WHERE `meetingrooms`.`id` = 5 LIMIT 1
UPDATE `meetingrooms` SET `image_file_name` = 'portraits_of_celebrities_640_12.jpg', `image_content_type` = 'image/jpeg', `image_file_size` = 44009, `image_updated_at` = '2011-09-12 07:17:13', `color` = '', `updated_at` = '2011-09-12 07:17:14' WHERE `meetingrooms`.`id` = 6
SELECT `meetingrooms`.* FROM `meetingrooms` LIMIT 1

  def create

    @meetingroom = Meetingroom.new(params[:meetingroom])
    if @meetingroom.save
---
INSERT INTO `meetingrooms` (`title`, `body`, `created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`) VALUES ('', '', '2011-06-12 09:56:13', '2011-06-12 09:56:13', 'beautiful girl in the world.jpg', 'image/jpeg', 36380, '2011-06-12 09:56:13')