app/controllers/newsposts_controller.rb

SELECT `newsposts`.* FROM `newsposts` ORDER BY created_at asc LIMIT 25 OFFSET 0
---
  def index
    @newsposts = Newspost.order(sort_column + ' ' + sort_direction).paginate(:per_page => 25, :page => params[:page])

SELECT `newsposts`.* FROM `newsposts` WHERE `newsposts`.`id` = 3 LIMIT 1
UPDATE `newsposts` SET `body` = '<p>Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad <a title=\"synthmax\" href=\"synthmax.dk\" target=\"_self\">minim</a> veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum2</p>', `updated_at` = '2011-09-11 15:54:13' WHERE `newsposts`.`id` = 3
---
  def update

    @newspost = Newspost.find(params[:id])
    if @newspost.update_attributes(params[:newspost])

INSERT INTO `newsposts` (`title`, `body`, `created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `internal_letter`) VALUES ('Ny gummiged', 'ny på rissisk', '2011-08-23 07:11:51', '2011-08-23 07:11:51', NULL, NULL, NULL, NULL, 0)
---
  def create

    @newspost = Newspost.new(params[:newspost])
    if @newspost.save