app/controllers/pages_controller.rb

SELECT `pages`.* FROM `pages` ORDER BY identity asc LIMIT 25 OFFSET 0
---
  def index
    session[:go_to_after_edit] = pages_path
    @pages = Page.order(sort_column + ' ' + sort_direction).paginate(:per_page => 25, :page => params[:page])