app/controllers/photos_controller.rb

  def show

     @photo = Photo.find(params[:id])
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`id` = 1 LIMIT 1

  def create

    @gallery = Gallery.find(params[:gallery_id])
    @photo = @gallery.photos.create(params[:photo])
---
INSERT INTO `photos` (`title`, `body`, `created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`) VALUES ('test', 'bla bla', '2011-09-12 10:51:19', '2011-09-12 10:51:19', NULL, NULL, NULL, NULL)

  def update
    @photo = Photo.find(params[:id])
    if @photo.update_attributes(params[:photo])
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`id` = 1 LIMIT 1
UPDATE `photos` SET `title` = 'Toppen af et hoved', `body` = 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.', `updated_at` = '2011-09-17 11:19:56' WHERE `photos`.`id` = 1