app/controllers/users_controller.rb

SELECT `info_pages`.* FROM `info_pages`
SELECT `users`.* FROM `users` ORDER BY email desc LIMIT 30 OFFSET 0
---
  def index
    # def index
    #   @products = Product.order(params[:sort])
    # end

    @users = User.order(sort_column + " " + sort_direction).paginate(:per_page => 30, :page => params[:page])

SELECT `users`.* FROM `users` LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `name` = 'Max Gronlund', `email` = 'tester@synthmax.dk', `grid` = 0, `image_file_name` = 'Skærmbillede 2011-05-01 kl. 10.48.37.png', `image_content_type` = 'image/png', `image_file_size` = 8976, `image_updated_at` = '2011-05-07 15:06:08', `updated_at` = '2011-05-07 15:06:08' WHERE `users`.`id` = 3
---
  def update
    params[:user].delete(:password) if params[:user][:password].blank?
    params[:user].delete(:password_confirmation) if params[:user][:password_confirmation].blank?
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

INSERT INTO `users` (`email`, `encrypted_password`, `password_salt`, `reset_password_token`, `remember_token`, `remember_created_at`, `sign_in_count`, `current_sign_in_at`, `last_sign_in_at`, `current_sign_in_ip`, `last_sign_in_ip`, `created_at`, `updated_at`, `role`, `name`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `language`, `grid`) VALUES ('admin@synthmax.dk', '$2a$10$df4UkFAz.Jv4pSYxivbQ1eRu/FD7fil1x8Q9f77xkY5p4.hmfdGiC', '$2a$10$df4UkFAz.Jv4pSYxivbQ1e', NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, '2011-08-23 10:51:20', '2011-08-23 10:51:20', 'admin', 'admin', NULL, NULL, NULL, NULL, NULL, NULL)
---
  def create
    @user = User.new(params[:user])
    @user.image_content_type = MIME::Types.type_for(@user.image.original_filename).first.to_s if @user.image.original_filename.present?
    @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def password
    @user = if current_user.admin_or_super?
      User.find(params[:id])